Tutorial/2022-09-01-114545-emacs_open_sqlite_dired.org
:PROPERTIES:
:ID:       40f2384e-f7fd-46b9-8b10-04c29176ea7f
:ROAM_TAGS:
:END:
#+TITLE: emacs open sqlite dired
#+CREATED: [2022-12-17 12:03:14]
#+LAST_MODIFIED: [2022-12-17 12:03:14]
+

* How to open sqlite files with dir
So i locked myself out of my gitea again, phone got wiped by mistake with a opsec tool called wasted, whiped itself while it wass in my hand!



** Methods
*** Sqlite dired
In [[https://www.reddit.com/r/emacs/comments/rlwipm/comment/hpjo30x][this]] post a reddit user was kind enough to share a snippet to do just this

#+begin_src emacs-lisp
(when (functionp 'sqlite-available-p)
  (require 'sqlite-mode)
  (defun sqlite-file-p ()
    (let* ((ms "SQLite format 3")
	   (msl (length ms)))
      (and (> (point-max) msl)
	   (string= (buffer-substring 1 (1+ msl))
		    ms))))
  (defun sqlite-mode-open-file* ()
    (let ((f (buffer-file-name)))
      (kill-buffer (current-buffer))
      (sqlite-mode-open-file f)))
  (add-to-list 'magic-mode-alist '(sqlite-file-p . sqlite-mode-open-file*)))
#+end_src

#+RESULTS:
