Tutorial/2022-09-01-114545-emacs_open_sqlite_dired.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-14 Fri 07:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs open sqlite dired</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">emacs open sqlite dired</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2d68134">How to open sqlite files with dir</a>
<ul>
<li><a href="#orga96089f">Methods</a>
<ul>
<li><a href="#org1ecf558">Sqlite dired</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li></li>
</ul>

<div id="outline-container-org2d68134" class="outline-2">
<h2 id="org2d68134">How to open sqlite files with dir</h2>
<div class="outline-text-2" id="text-org2d68134">
<p>
So i locked myself out of my gitea again, phone got wiped by mistake with a opsec tool called wasted, whiped itself while it wass in my hand!
</p>
</div>



<div id="outline-container-orga96089f" class="outline-3">
<h3 id="orga96089f">Methods</h3>
<div class="outline-text-3" id="text-orga96089f">
</div>
<div id="outline-container-org1ecf558" class="outline-4">
<h4 id="org1ecf558">Sqlite dired</h4>
<div class="outline-text-4" id="text-org1ecf558">
<p>
In <a href="https://www.reddit.com/r/emacs/comments/rlwipm/comment/hpjo30x">this</a> post a reddit user was kind enough to share a snippet to do just this
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #ff2afc;">(</span><span style="color: #df85ff; font-weight: bold;">functionp</span> <span style="color: #ff2afc;">'</span><span style="color: #ffd400;">sqlite-available-p</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #df85ff; font-weight: bold;">require</span> <span style="color: #ff2afc;">'</span><span style="color: #df85ff; font-weight: bold;">sqlite-mode</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff;">sqlite-file-p</span> <span style="color: #a7da1e;">(</span><span style="color: #a7da1e;">)</span>
    <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">let*</span> <span style="color: #df85ff;">(</span><span style="color: #1ea8fc;">(</span>ms <span style="color: #7984D1;">"SQLite format 3"</span><span style="color: #1ea8fc;">)</span>
           <span style="color: #1ea8fc;">(</span>msl <span style="color: #ff2afc;">(</span><span style="color: #df85ff; font-weight: bold;">length</span> ms<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span><span style="color: #df85ff;">)</span>
      <span style="color: #df85ff;">(</span><span style="color: #ff2afc; font-weight: bold;">and</span> <span style="color: #1ea8fc;">(</span><span style="color: #df85ff; font-weight: bold;">&gt;</span> <span style="color: #ff2afc;">(</span><span style="color: #df85ff; font-weight: bold;">point-max</span><span style="color: #ff2afc;">)</span> msl<span style="color: #1ea8fc;">)</span>
           <span style="color: #1ea8fc;">(</span><span style="color: #df85ff; font-weight: bold;">string=</span> <span style="color: #ff2afc;">(</span><span style="color: #df85ff; font-weight: bold;">buffer-substring</span> <span style="color: #ffd400; font-weight: bold;">1</span> <span style="color: #a7da1e;">(</span><span style="color: #df85ff; font-weight: bold;">1+</span> msl<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
                    ms<span style="color: #1ea8fc;">)</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff;">sqlite-mode-open-file*</span> <span style="color: #a7da1e;">(</span><span style="color: #a7da1e;">)</span>
    <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">let</span> <span style="color: #df85ff;">(</span><span style="color: #1ea8fc;">(</span>f <span style="color: #ff2afc;">(</span><span style="color: #df85ff;">buffer-file-name</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span><span style="color: #df85ff;">)</span>
      <span style="color: #df85ff;">(</span><span style="color: #df85ff; font-weight: bold;">kill-buffer</span> <span style="color: #1ea8fc;">(</span><span style="color: #df85ff; font-weight: bold;">current-buffer</span><span style="color: #1ea8fc;">)</span><span style="color: #df85ff;">)</span>
      <span style="color: #df85ff;">(</span>sqlite-mode-open-file f<span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #df85ff; font-weight: bold;">add-to-list</span> <span style="color: #ff2afc;">'</span><span style="color: #df85ff;">magic-mode-alist</span> <span style="color: #ff2afc;">'</span><span style="color: #a7da1e;">(</span>sqlite-file-p . sqlite-mode-open-file*<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6.1)</p>
<p class="validation"></p>
</div>
</body>
</html>